{
  "basicos": {
    "titulo": "📘 PARTE I – CONHECIMENTOS BÁSICOS",
    "texto": {
      "titulo": "A Inteligência Artificial Generativa e os Limites da Autonomia Humana",
      "linhas": [
        "A emergência de sistemas de inteligência artificial generativa, capazes de produzir conteúdos originais em texto, imagem e som, transformou a dinâmica da comunicação contemporânea.",
        "Ao serem integradas a plataformas de busca, redes sociais e ambientes corporativos, essas tecnologias alteram profundamente os modos de produção e circulação de informações.",
        "Enquanto alguns especialistas celebram o potencial inovador desses sistemas, outros apontam riscos associados à confiabilidade e à transparência dos conteúdos gerados.",
        "Um dos dilemas centrais envolve a dificuldade de identificar a origem e a veracidade das informações produzidas por algoritmos, que podem reproduzir vieses implícitos em seus dados de treinamento.",
        "Esse fenômeno não apenas ameaça a credibilidade de fontes tradicionais, mas também desafia mecanismos de responsabilização jurídica por eventuais danos causados por conteúdos inverídicos.",
        "Além disso, a automação intensiva de tarefas intelectuais suscita questões sobre o lugar da criatividade humana em processos antes considerados exclusivamente racionais ou artísticos.",
        "Para alguns estudiosos, delegar atividades complexas a máquinas pode reduzir gradativamente a autonomia cognitiva dos indivíduos, criando dependência tecnológica estrutural.",
        "Por outro lado, defensores da IA generativa argumentam que sua capacidade de processar grandes volumes de informação contribui para democratizar o acesso ao conhecimento e ampliar oportunidades educacionais e profissionais.",
        "Essa visão, porém, não elimina a necessidade de políticas regulatórias capazes de mitigar desigualdades e proteger direitos fundamentais.",
        "Nesse contexto, o debate público tende a se polarizar entre discursos que ressaltam a eficiência tecnológica e narrativas que enfatizam riscos."
      ]
    },
    "temas": [
      {
        "nome": "PORTUGUÊS",
        "questoes": [
          {
            "id": 1,
            "enunciado": "Infere-se do texto que, para alguns estudiosos, o uso intensivo da inteligência artificial generativa pode comprometer a autonomia intelectual dos indivíduos ao criar uma forma de dependência estrutural.",
            "gabarito": "C"
          },
          {
            "id": 2,
            "enunciado": "O texto defende que, embora existam riscos relacionados à IA generativa, a sua capacidade de democratizar o acesso ao conhecimento é inquestionável e suficiente para justificar seu uso irrestrito.",
            "gabarito": "E"
          },
          {
            "id": 3,
            "enunciado": "No trecho 'Esse fenômeno não apenas ameaça a credibilidade de fontes tradicionais, mas também desafia mecanismos de responsabilização jurídica', estabelece-se relação de adição entre as duas orações coordenadas.",
            "gabarito": "C"
          },
          {
            "id": 4,
            "enunciado": "O uso do termo 'Por outro lado' no oitavo período do texto introduz uma ideia de oposição em relação ao argumento imediatamente anterior sobre a redução da autonomia cognitiva.",
            "gabarito": "C"
          },
          {
            "id": 5,
            "enunciado": "No penúltimo período do texto, o vocábulo 'essa' retoma a expressão 'capacidade de processar grandes volumes de informação', exercendo função de sujeito da oração em que está inserido.",
            "gabarito": "C"
          },
          {
            "id": 6,
            "enunciado": "Seria mantida a correção gramatical e o sentido original do texto caso o termo 'produzidas' na quarta linha fosse substituído por 'omitidas'.",
            "gabarito": "E"
          },
          {
            "id": 7,
            "enunciado": "No segundo período do texto, as formas verbais 'alteram' e 'circulação' mantêm relação de concordância com o termo 'plataformas', que exerce função de sujeito composto da oração.",
            "gabarito": "E"
          },
          {
            "id": 8,
            "enunciado": "No trecho 'delegar atividades complexas a máquinas pode reduzir gradativamente a autonomia cognitiva dos indivíduos', a inserção do sinal indicativo de crase no vocábulo 'a' prejudicaria a correção gramatical.",
            "gabarito": "C"
          },
          {
            "id": 9,
            "enunciado": "No último período do texto, a expressão 'narrativas que enfatizam riscos' estabelece uma relação de explicação com 'discursos que ressaltam a eficiência tecnológica'.",
            "gabarito": "E"
          },
          {
            "id": 10,
            "enunciado": "A supressão da vírgula após 'profissionais' no oitavo período do texto manteria a correção gramatical, já que essa pontuação é opcional no contexto apresentado.",
            "gabarito": "E"
          }
        ]
      },
      {
        "nome": "INFORMÁTICA",
        "questoes": [
          {
            "id": 11,
            "enunciado": "No LibreOffice, o aplicativo Base é destinado prioritariamente à criação e edição de apresentações multimídia, como slides e animações para exibição pública.",
            "gabarito": "E"
          },
          {
            "id": 12,
            "enunciado": "O Windows 10 possui ferramenta nativa chamada Explorador de Arquivos, que permite ao usuário renomear arquivos, copiar pastas e visualizar propriedades de documentos armazenados localmente.",
            "gabarito": "C"
          },
          {
            "id": 13,
            "enunciado": "O endereço eletrônico https://www.gov.br corresponde a um portal oficial do governo brasileiro, e pode ser acessado por diferentes navegadores modernos, independentemente do sistema operacional utilizado pelo usuário.",
            "gabarito": "C"
          },
          {
            "id": 14,
            "enunciado": "O spyware é um tipo de software malicioso que atua principalmente criptografando os dados do usuário e exigindo pagamento de resgate, comportamento típico dos ransomwares.",
            "gabarito": "E"
          }
        ]
      },
      {
        "nome": "NOÇÕES DE DIREITO ADMINISTRATIVO",
        "questoes": [
          {
            "id": 15,
            "enunciado": "Nos termos da Lei nº 9.784/1999, o ato administrativo praticado por agente incompetente é considerado inexistente e não admite convalidação posterior, ainda que não tenha causado prejuízo ao interesse público ou a terceiros.",
            "gabarito": "E"
          },
          {
            "id": 16,
            "enunciado": "O poder de autotutela permite que a administração pública reveja seus próprios atos, anulando aqueles ilegais e revogando os inconvenientes ou inoportunos, independentemente de provocação do interessado.",
            "gabarito": "C"
          },
          {
            "id": 17,
            "enunciado": "A revogação de ato administrativo produz efeitos retroativos, atingindo situações jurídicas perfeitas e consumadas, salvo quando houver decisão judicial em sentido diverso.",
            "gabarito": "E"
          },
          {
            "id": 18,
            "enunciado": "De acordo com a LINDB, a mudança de orientação administrativa que implique nova interpretação jurídica deve, sempre que possível, ser precedida de justificação formal que demonstre a necessidade de alteração e considere os efeitos práticos da decisão.",
            "gabarito": "C"
          },
          {
            "id": 19,
            "enunciado": "O poder de polícia administrativa caracteriza-se pela discricionariedade, autoexecutoriedade e coercibilidade, podendo, contudo, ser vinculado quando a lei assim estabelecer.",
            "gabarito": "C"
          },
          {
            "id": 20,
            "enunciado": "Conforme a Lei nº 9.784/1999, a motivação do ato administrativo é requisito essencial apenas nos casos em que a lei expressamente a exigir, dispensando-se em situações de revogação por conveniência e oportunidade.",
            "gabarito": "E"
          },
          {
            "id": 21,
            "enunciado": "Os atos administrativos discricionários estão sujeitos a controle judicial restrito quanto à legalidade, sendo vedado ao Judiciário examinar aspectos relacionados ao mérito administrativo.",
            "gabarito": "C"
          }
        ]
      },
      {
        "nome": "NOÇÕES DE DIREITO CONSTITUCIONAL",
        "questoes": [
          {
            "id": 22,
            "enunciado": "O direito ao livre exercício de qualquer trabalho, ofício ou profissão consubstancia norma constitucional de eficácia contida, cujo núcleo essencial é plenamente aplicável independentemente de lei regulamentadora.",
            "gabarito": "C"
          },
          {
            "id": 23,
            "enunciado": "Os municípios possuem competência legislativa plena para editar normas gerais sobre matéria de seguros, por se tratar de tema inserido no âmbito de interesse local.",
            "gabarito": "E"
          },
          {
            "id": 24,
            "enunciado": "A Constituição Federal assegura aos aposentados o direito de participar da administração sindical, podendo integrar a diretoria da entidade, nos termos da jurisprudência consolidada do STF.",
            "gabarito": "C"
          },
          {
            "id": 25,
            "enunciado": "A omissão legislativa que inviabiliza a concretização de normas constitucionais programáticas pode, em determinadas hipóteses, legitimar a propositura de mandado de injunção.",
            "gabarito": "C"
          },
          {
            "id": 26,
            "enunciado": "A competência privativa da União para legislar sobre normas gerais pode ser delegada aos Estados por meio de lei complementar, hipótese não admitida pela Constituição.",
            "gabarito": "E"
          },
          {
            "id": 27,
            "enunciado": "A exigência municipal de contratação obrigatória de seguro por estabelecimentos comerciais, ainda que fundada no interesse local, é considerada constitucional por não haver conflito com competência federal.",
            "gabarito": "E"
          },
          {
            "id": 28,
            "enunciado": "O Supremo Tribunal Federal admite que a competência legislativa concorrente autoriza os municípios a editar normas gerais quando ausente legislação federal ou estadual sobre determinada matéria.",
            "gabarito": "E"
          }
        ]
      },
      {
        "nome": "NOÇÕES DE DIREITO PENAL, PROCESSO PENAL E CRIMINALÍSTICA",
        "questoes": [
          {
            "id": 29,
            "enunciado": "O crime permanente caracteriza-se pela continuidade da situação típica, permitindo a prisão em flagrante enquanto persistir a permanência.",
            "gabarito": "C"
          },
          {
            "id": 30,
            "enunciado": "A execução da pena restritiva de direitos prescinde do trânsito em julgado da condenação, podendo iniciar-se logo após a sentença condenatória de primeiro grau.",
            "gabarito": "E"
          },
          {
            "id": 31,
            "enunciado": "O arrependimento posterior só pode ser reconhecido se a reparação do dano ocorrer até antes do recebimento da denúncia ou queixa.",
            "gabarito": "C"
          },
          {
            "id": 32,
            "enunciado": "Nos crimes culposos, qualquer que seja a quantidade de pena aplicada, admite-se a substituição da pena privativa de liberdade por restritiva de direitos, salvo vedação legal expressa.",
            "gabarito": "C"
          },
          {
            "id": 33,
            "enunciado": "A interceptação telefônica somente é admissível quando a prova não puder ser feita por outros meios disponíveis, sendo indispensável a decisão judicial fundamentada.",
            "gabarito": "C"
          },
          {
            "id": 34,
            "enunciado": "A prisão temporária pode ser decretada de ofício pelo juiz, sempre que entender conveniente para a investigação criminal.",
            "gabarito": "E"
          },
          {
            "id": 35,
            "enunciado": "O erro sobre elemento constitutivo do tipo penal exclui o dolo, mas poderá permitir a punição por crime culposo, se previsto em lei.",
            "gabarito": "C"
          },
          {
            "id": 36,
            "enunciado": "Na cadeia de custódia, a quebra injustificada do lacre de invólucro contendo vestígios implica nulidade absoluta do exame pericial correspondente.",
            "gabarito": "E"
          },
          {
            "id": 37,
            "enunciado": "O local de crime deverá permanecer preservado até a chegada da perícia oficial, salvo situações em que houver necessidade de socorro imediato às vítimas ou segurança pública.",
            "gabarito": "C"
          },
          {
            "id": 38,
            "enunciado": "A ausência de suspensão ou revogação do livramento condicional antes do término do período de prova impede a extinção da punibilidade pelo cumprimento integral da pena.",
            "gabarito": "E"
          },
          {
            "id": 39,
            "enunciado": "Conforme o Código de Processo Penal, a decisão que rejeita a denúncia ou a queixa pode ser impugnada por recurso em sentido estrito.",
            "gabarito": "C"
          },
          {
            "id": 40,
            "enunciado": "A perícia oficial, nos casos previstos em lei, pode ser realizada por apenas um perito oficial, quando não for possível a designação de dois.",
            "gabarito": "C"
          },
          {
            "id": 41,
            "enunciado": "A colaboração premiada pode ser celebrada com a vítima de infração penal, por ser instrumento destinado à obtenção de prova.",
            "gabarito": "E"
          },
          {
            "id": 42,
            "enunciado": "O Supremo Tribunal Federal admite a execução provisória de medidas de segurança, desde que respeitado o devido processo legal e a ampla defesa.",
            "gabarito": "E"
          },
          {
            "id": 43,
            "enunciado": "O crime de importunação sexual é considerado crime hediondo pela Lei nº 8.072/1990.",
            "gabarito": "E"
          }
        ]
      },
      {
        "nome": "DIREITOS HUMANOS",
        "questoes": [
          {
            "id": 44,
            "enunciado": "O Protocolo Facultativo à Convenção contra a Tortura estabelece a criação de mecanismos nacionais de prevenção, competentes para visitar locais de privação de liberdade, com o objetivo de fortalecer a proteção das pessoas privadas de liberdade contra tratamentos cruéis.",
            "gabarito": "C"
          },
          {
            "id": 45,
            "enunciado": "De acordo com a Declaração Universal dos Direitos Humanos, somente os nacionais de um Estado gozam do direito de buscar asilo em caso de perseguição, não sendo esse direito estendido a estrangeiros ou apátridas.",
            "gabarito": "E"
          }
        ]
      },
      {
        "nome": "RACIOCÍNIO LÓGICO",
        "questoes": [
          {
            "id": 46,
            "enunciado": "Se todos os projetos sustentáveis são financiados e alguns projetos financiados recebem apoio internacional, então necessariamente todos os projetos sustentáveis recebem apoio internacional.",
            "gabarito": "E"
          },
          {
            "id": 47,
            "enunciado": "A negação lógica da proposição 'Se o relatório foi aprovado, então o projeto será iniciado' é 'O relatório não foi aprovado ou o projeto será iniciado'.",
            "gabarito": "E"
          },
          {
            "id": 48,
            "enunciado": "Considerando a proposição composta: 'Se Pedro é advogado e Mariana é engenheira, então João é médico ou Carla é professora', o número de linhas da tabela-verdade dessa proposição é igual a 8.",
            "gabarito": "C"
          },
          {
            "id": 49,
            "enunciado": "A expressão (~P → ~Q) ↔ (Q → P) representa uma tautologia, pois apresenta valor lógico verdadeiro em todas as linhas de sua tabela-verdade.",
            "gabarito": "C"
          },
          {
            "id": 50,
            "enunciado": "Se 60% dos servidores públicos possuem formação em Direito e, entre estes, 25% também possuem formação em Administração, então a porcentagem de servidores que possuem ambas as formações é igual a 20%.",
            "gabarito": "E"
          }
        ]
      }
    ]
  },

  "especificos": {
    "titulo": "📗 CONHECIMENTOS ESPECÍFICOS",
    "temas": [
      {
        "nome": "ARQUITETURA DE COMPUTADORES",
        "questoes": [
          {
            "id": 51,
            "enunciado": "Na arquitetura de Von Neumann, dados e instruções compartilham o mesmo espaço de memória e o mesmo barramento, resultando em uma limitação conhecida como gargalo de Von Neumann.",
            "gabarito": "C"
          },
          {
            "id": 52,
            "enunciado": "A arquitetura Harvard diferencia-se da de Von Neumann por adotar um único espaço de memória para dados e instruções, otimizando o desempenho ao reduzir latências de acesso.",
            "gabarito": "E"
          },
          {
            "id": 53,
            "enunciado": "Registradores são pequenas áreas de armazenamento localizadas na CPU e possuem tempos de acesso muito inferiores ao das memórias cache e RAM.",
            "gabarito": "C"
          },
          {
            "id": 54,
            "enunciado": "O registrador de instrução (IR) tem a função principal de armazenar o endereço de memória do dado a ser lido ou gravado durante a execução de uma instrução.",
            "gabarito": "E"
          },
          {
            "id": 55,
            "enunciado": "O Master Boot Record (MBR) é um setor localizado no primeiro segmento do disco rígido e contém informações essenciais de inicialização e a tabela de partições do sistema.",
            "gabarito": "C"
          },
          {
            "id": 56,
            "enunciado": "O BIOS é um firmware armazenado em memória ROM ou flash, responsável por inicializar dispositivos de hardware e carregar o carregador de boot do sistema operacional.",
            "gabarito": "C"
          },
          {
            "id": 57,
            "enunciado": "O cache write-through armazena dados apenas no cache, atualizando a memória principal somente quando o bloco de cache é removido ou substituído.",
            "gabarito": "E"
          },
          {
            "id": 58,
            "enunciado": "O barramento de endereços tem como função transportar os sinais de controle entre o processador e outros dispositivos, como memória e periféricos.",
            "gabarito": "E"
          },
          {
            "id": 59,
            "enunciado": "O pipeline de instruções permite sobreposição de etapas como busca, decodificação e execução, aumentando a taxa de execução geral do processador.",
            "gabarito": "C"
          },
          {
            "id": 60,
            "enunciado": "Em arquiteturas RISC, as instruções tendem a ser simples, de tamanho fixo, e geralmente executadas em um único ciclo de clock.",
            "gabarito": "C"
          },
          {
            "id": 61,
            "enunciado": "O conceito de superescalaridade refere-se à capacidade do processador de executar múltiplas instruções simultaneamente em pipelines paralelos.",
            "gabarito": "C"
          },
          {
            "id": 62,
            "enunciado": "Os processadores CISC utilizam instruções simples e uniformes, com sintaxe reduzida, priorizando alta previsibilidade na execução.",
            "gabarito": "E"
          },
          {
            "id": 63,
            "enunciado": "DMA (acesso direto à memória) permite que dispositivos periféricos realizem transferências de dados para a memória principal sem intervenção constante da CPU.",
            "gabarito": "C"
          },
          {
            "id": 64,
            "enunciado": "A hierarquia de memória tem como princípio básico o uso exclusivo de memórias voláteis de alta capacidade e baixo custo, garantindo desempenho ideal.",
            "gabarito": "E"
          },
          {
            "id": 65,
            "enunciado": "Unidades de ponto flutuante (FPU) são responsáveis pela execução de operações aritméticas envolvendo números reais com maior precisão que operações inteiras.",
            "gabarito": "C"
          },
          {
            "id": 66,
            "enunciado": "Em sistemas multiprocessados com memória compartilhada, a coerência de cache garante que todos os processadores vejam o mesmo valor de dado modificado, mesmo que armazenado em caches locais distintos.",
            "gabarito": "C"
          },
          {
            "id": 67,
            "enunciado": "A memória ROM é caracterizada por ser volátil, ou seja, seu conteúdo é perdido quando ocorre desligamento do equipamento.",
            "gabarito": "E"
          }
        ]
      },

      {
        "nome": "BANCO DE DADOS",
        "questoes": [
          {
            "id": 68,
            "enunciado": "O comando SQL SELECT campo FROM tabela corresponde, na álgebra relacional, a uma operação de projeção, pois retorna um subconjunto de colunas da relação original.",
            "gabarito": "C"
          },
          {
            "id": 69,
            "enunciado": "Em bancos de dados relacionais, uma chave primária pode conter um ou mais atributos que, em conjunto, identificam de forma única cada tupla na tabela.",
            "gabarito": "C"
          },
          {
            "id": 70,
            "enunciado": "O arquivo pg_hba.conf do PostgreSQL define políticas de autenticação e controle de acesso, sendo as diretivas avaliadas da última linha para a primeira linha.",
            "gabarito": "E"
          },
          {
            "id": 71,
            "enunciado": "No processo de otimização de consultas SQL, fatores como estatísticas de cardinalidade e distribuição de valores podem influenciar o plano de execução escolhido pelo otimizador.",
            "gabarito": "C"
          },
          {
            "id": 72,
            "enunciado": "O modelo entidade-relacionamento permite representação de relacionamentos ternários, ou seja, que envolvem três entidades ao mesmo tempo.",
            "gabarito": "C"
          },
          {
            "id": 73,
            "enunciado": "O comando SQL DELETE FROM tabela WHERE condição executa uma operação de projeção que remove apenas colunas selecionadas da tabela.",
            "gabarito": "E"
          },
          {
            "id": 74,
            "enunciado": "Em sistemas distribuídos, um servidor federado é capaz de processar consultas que envolvem múltiplas bases de dados heterogêneas como se fossem uma única fonte.",
            "gabarito": "C"
          },
          {
            "id": 75,
            "enunciado": "A normalização visa reduzir redundâncias e anomalias de atualização, podendo resultar no aumento do número de tabelas e na complexidade de junções durante as consultas.",
            "gabarito": "C"
          },
          {
            "id": 76,
            "enunciado": "No PostgreSQL, o comando VACUUM é utilizado exclusivamente para criar índices B-tree em colunas que possuem alta cardinalidade.",
            "gabarito": "E"
          },
          {
            "id": 77,
            "enunciado": "Em sistemas hierárquicos, o servidor que distribui consultas entre fontes remotas é denominado servidor federado e não servidor hierárquico.",
            "gabarito": "C"
          }
        ]
      },

      {
        "nome": "REDES E SEGURANÇA",
        "questoes": [
          {
            "id": 78,
            "enunciado": "As redes locais (LANs) caracterizam-se por permitir o compartilhamento de recursos em áreas geográficas restritas e podem ser diferenciadas de outros tipos de rede pelo tamanho, pela topologia e pela tecnologia de transmissão.",
            "gabarito": "C"
          },
          {
            "id": 79,
            "enunciado": "Nas LANs em topologia anel, não há necessidade de mecanismos específicos de controle de acesso ao meio, pois cada nó transmite de forma independente, sem risco de colisão.",
            "gabarito": "E"
          },
          {
            "id": 80,
            "enunciado": "O padrão IEEE 802.11b não utiliza tecnologia MIMO e oferece taxas máximas de transmissão inferiores a 20 Mbps.",
            "gabarito": "C"
          },
          {
            "id": 81,
            "enunciado": "Bluetooth apresenta alcance tipicamente menor que o Wi-Fi e oferece menor taxa de transmissão, sendo classificado como uma tecnologia de rede pessoal (PAN).",
            "gabarito": "C"
          },
          {
            "id": 82,
            "enunciado": "As redes sem fio IEEE 802.11 utilizam CSMA/CA como método de acesso ao meio, diferentemente do CSMA/CD empregado em redes Ethernet cabeadas.",
            "gabarito": "C"
          },
          {
            "id": 83,
            "enunciado": "O protocolo WEP do IEEE 802.11 é considerado seguro e amplamente recomendado, pois utiliza criptografia de chave simétrica robusta baseada em algoritmos AES.",
            "gabarito": "E"
          },
          {
            "id": 84,
            "enunciado": "O ICMP integra a pilha de protocolos IP e é usado para diagnóstico e controle, incluindo a funcionalidade de envio de mensagens de redirecionamento de rota.",
            "gabarito": "C"
          },
          {
            "id": 85,
            "enunciado": "O ICMP é um protocolo de transporte confiável, garantindo a entrega ordenada de mensagens de eco e resposta de eco.",
            "gabarito": "E"
          },
          {
            "id": 86,
            "enunciado": "O RADIUS utiliza, por padrão, o protocolo UDP como transporte e aplica autenticação centralizada de usuários e registro de atividades.",
            "gabarito": "C"
          },
          {
            "id": 87,
            "enunciado": "O TACACS+ opera exclusivamente sobre UDP e não suporta criptografia de cargas de dados, apenas autenticação básica.",
            "gabarito": "E"
          },
          {
            "id": 88,
            "enunciado": "A MIB (Management Information Base) utiliza o padrão ASN.1 para especificar a estrutura dos objetos gerenciados em redes SNMP.",
            "gabarito": "C"
          },
          {
            "id": 89,
            "enunciado": "O comando ping envia mensagens ICMP de solicitação de eco (tipo 8) e espera respostas de eco (tipo 0) para verificar a conectividade com um destino.",
            "gabarito": "C"
          },
          {
            "id": 90,
            "enunciado": "A função criptográfica MAC (Message Authentication Code) utiliza chaves assimétricas para produzir valores de autenticação vinculados à mensagem.",
            "gabarito": "E"
          },
          {
            "id": 91,
            "enunciado": "A segurança da informação recomenda, como boa prática, que a regra padrão de controle de acesso seja 'tudo é permitido, salvo se explicitamente proibido'.",
            "gabarito": "E"
          },
          {
            "id": 92,
            "enunciado": "Em ambientes virtuais, a migração de máquinas virtuais pode ocorrer sem interrupção de serviço, permitindo continuidade operacional mesmo durante manutenção programada.",
            "gabarito": "C"
          },
          {
            "id": 93,
            "enunciado": "O hipervisor tipo 1 executa diretamente sobre o hardware físico e atua como camada mínima de abstração entre o hardware e as máquinas virtuais.",
            "gabarito": "C"
          },
          {
            "id": 94,
            "enunciado": "O protocolo SMTP é utilizado exclusivamente para recebimento de mensagens de e-mail pelos clientes e não para envio.",
            "gabarito": "E"
          },
          {
            "id": 95,
            "enunciado": "O uso de honeypots permite detectar atividades maliciosas e coletar informações sobre métodos de ataque, servindo como instrumento de proteção e análise de ameaças.",
            "gabarito": "C"
          },
          {
            "id": 96,
            "enunciado": "A criptografia assimétrica utiliza a mesma chave para cifrar e decifrar dados, garantindo integridade e sigilo com baixo custo computacional.",
            "gabarito": "E"
          },
          {
            "id": 97,
            "enunciado": "A norma ISO/IEC 27002 estabelece diretrizes para a gestão da segurança da informação, incluindo controles relacionados a ativos, recursos humanos e operações.",
            "gabarito": "C"
          }
        ]
      },
      {
        "nome": "DESENVOLVIMENTO DE SOFTWARE",
        "questoes": [
          {
            "id": 98,
            "enunciado": "No modelo serverless, o provedor de nuvem gerencia automaticamente a infraestrutura subjacente, incluindo escalonamento, provisionamento e execução de código em resposta a eventos, dispensando configuração manual de servidores.",
            "gabarito": "C"
          },
          {
            "id": 99,
            "enunciado": "O HTTP/2 permite multiplexação de requisições sobre uma única conexão TCP persistente, enquanto no HTTP/1 cada requisição requer abertura de nova conexão obrigatoriamente.",
            "gabarito": "E"
          },
          {
            "id": 100,
            "enunciado": "No Kubernetes, pods são unidades de execução que contêm um ou mais contêineres e podem ser escalados automaticamente de acordo com a demanda, mesmo em ambientes FaaS.",
            "gabarito": "C"
          },
          {
            "id": 101,
            "enunciado": "O padrão GoF Abstract Factory é classificado como padrão estrutural, pois define uma interface para criação de famílias de objetos, ao passo que o padrão Facade é considerado criacional por facilitar a criação de instâncias complexas.",
            "gabarito": "E"
          },
          {
            "id": 102,
            "enunciado": "No DevSecOps, o uso de ferramentas DAST (Dynamic Application Security Testing) é recomendado para identificação de vulnerabilidades em aplicações em execução, conforme orientações do OWASP.",
            "gabarito": "C"
          },
          {
            "id": 103,
            "enunciado": "A programação assíncrona em linguagens como Python implica execução paralela de instruções em múltiplas threads, sendo sempre dependente do suporte a multiprocessamento nativo.",
            "gabarito": "E"
          },
          {
            "id": 104,
            "enunciado": "No padrão Composite, um objeto composto pode conter instâncias de outros objetos, permitindo representar hierarquias de forma recursiva e uniforme.",
            "gabarito": "C"
          },
          {
            "id": 105,
            "enunciado": "No modelo RESTful, as APIs são tipicamente stateless, ou seja, cada requisição é independente das anteriores e contém todas as informações necessárias para seu processamento.",
            "gabarito": "C"
          },
          {
            "id": 106,
            "enunciado": "O TDD (Test Driven Development) estabelece que a especificação dos testes seja criada após a codificação da funcionalidade, servindo apenas como validação do comportamento implementado.",
            "gabarito": "E"
          },
          {
            "id": 107,
            "enunciado": "No desenvolvimento seguro, práticas como validação de entrada, uso de criptografia atualizada e gestão de dependências são recomendadas para mitigar vulnerabilidades como SQL Injection e XSS.",
            "gabarito": "C"
          }
        ]
      },
      {
        "nome": "GOVERNANÇA DE TI E LEGISLAÇÃO APLICADA. INSTRUÇÃO NORMATIVA SGD/ME Nº 94/2022.",
        "questoes": [
          {
            "id": 116,
            "enunciado": "De acordo com o COBIT 2019, o componente denominado Information Flow and Communication visa garantir que a informação relevante seja compartilhada de maneira tempestiva, precisa e eficaz, promovendo alinhamento entre a estratégia de TI e os objetivos organizacionais.",
            "gabarito": "C"
          },
          {
            "id": 117,
            "enunciado": "Segundo o ITIL v4, a prática de gestão de mudanças emergenciais requer que todas as mudanças passem pelo processo completo de avaliação por CAB (Change Advisory Board), independentemente do seu impacto no serviço.",
            "gabarito": "E"
          },
          {
            "id": 118,
            "enunciado": "Na governança de dados, conforme preconiza a LGPD e boas práticas de segurança da informação, é recomendável que o ciclo de vida dos dados pessoais seja estruturado com base em princípios de minimização, limitação da finalidade e retenção proporcional ao objetivo do tratamento.",
            "gabarito": "C"
          },
          {
            "id": 119,
            "enunciado": "No contexto de contratos de serviços em nuvem, a responsabilidade pela continuidade dos serviços e pela segurança lógica dos dados permanece exclusivamente com o provedor, não havendo obrigações de gestão compartilhada com o cliente.",
            "gabarito": "E"
          },
          {
            "id": 120,
            "enunciado": "O framework COBIT 2019 define como princípio fundamental que a criação de valor depende da governança e do gerenciamento integrados, devendo ambos atuar de forma dissociada para otimizar recursos e garantir a conformidade regulatória.",
            "gabarito": "E"
          }
        ]
      }
    ]
  }
}